/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isprint.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: lcardiga <lcardiga@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/04 17:09:40 by lcardiga          #+#    #+#             */
/*   Updated: 2021/10/10 19:00:02 by lcardiga         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*
 * Функция isprint() возвращает ненулевое значение,если аргумент является
печатным символом, включая пробел; в противном случае возвращается 0. Значения 
печатных символов находятся в пределах от 0x20 до 0х7Е. 
(0x20 = 32[SPACE]; 0х7Е = 126[~]
 */

#include "libft.h"

int	ft_isprint(int c)
{
	if (c >= 32 && c <= 126)
		return (1);
	return (0);
}
