/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isalnum.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: lcardiga <lcardiga@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/04 16:23:09 by lcardiga          #+#    #+#             */
/*   Updated: 2021/10/14 17:33:49 by lcardiga         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* Функция isalnum - функция стандартной библиотеки языка C, подключаемая в 
заголовочном файле ctype.h. Функция проверяет, является ли аргумент c типа int 
буквой или цифрой.
Возвращает 0 если аргумент не является цифрой или буквой и ненулевое значение в 
противном случае. 
*/

#include "libft.h"

int	ft_isalnum(int c)
{
	if ((c >= '0' && c <= '9') || (c >= 'a' && c <= 'z')
		|| (c >= 'A' && c <= 'Z'))
		return (1);
	return (0);
}
